import DisplayCard from "@/component/ui/DisplayCard/DisplayCard";

const TERM_TEXT = `3.1 ฝาก-ไถ่ถอนทรัพย์สิน ต้องเป็นบุคคลเดียวกัน
3.2 อัตราดอกเบี้ยเป็นไปตามเงื่อนไขบริษัทฯ กำหนด
3.3 ในกรณีจ้างของทรัพย์สินโดยไม่มีบัตรฝาก จะต้องมีหนังสือมอบอำนาจ พร้อมสำเนาบัตรประชาชนที่ผู้มอบอำนาจลงนามรับรองมาแสดงทุกครั้งที่ทำการ ต่อดอก-ไถ่ถอนทรัพย์สิน
3.4 อัตราดอกเบี้ย 1-15 วันคิดครึ่งเดือน 16-30 วัน คิด 1 เดือน โดยนับจากวันฝากเป็นวันที่ 1
3.5 กรณีครบกำหนดไถ่ถอนแล้ว สามารถขยายเวลาออกไปได้อีกไม่เกิน 7 วัน นับจากวันครบกำหนดไถ่ถอน
3.6 หากเกินระยะเวลาขยายจากวันครบกำหนดที่ได้ตกลงไว้ บริษัทฯ จะถือว่าทรัพย์สินนั้นตกเป็นกรรมสิทธิ์ของบริษัทฯ
3.7 กรณีเอกสารขายฝากสูญหาย ต้องมีเอกสารแจ้งความและสำเนาบัตรประชาชนของเจ้าของทรัพย์สินเพื่อแสดงตัวตนในการทำธุรกรรมทุกครั้ง
3.8 สำหรับรายการชำระดอกเบี้ยออนไลน์ จะมีค่าธรรมเนียมการชำระเงิน 5 บาท ต่อรายการ
`;

const TERM_LIST = [
  "ฝาก-ไถ่ถอนทรัพย์สิน ต้องเป็นบุคคลเดียวกัน",
  "อัตราดอกเบี้ยเป็นไปตามเงื่อนไขบริษัทฯ กำหนด",
  "ในกรณีจ้างของทรัพย์สินโดยไม่มีบัตรฝาก จะต้องมีหนังสือมอบอำนาจ พร้อมสำเนาบัตรประชาชนที่ผู้มอบอำนาจลงนามรับรองมาแสดงทุกครั้งที่ทำการ ต่อดอก-ไถ่ถอนทรัพย์สิน",
  "อัตราดอกเบี้ย 1-15 วันคิดครึ่งเดือน 16-30 วัน คิด 1 เดือน โดยนับจากวันฝากเป็นวันที่ 1",
  "กรณีครบกำหนดไถ่ถอนแล้ว สามารถขยายเวลาออกไปได้อีกไม่เกิน 7 วัน นับจากวันครบกำหนดไถ่ถอน",
  "หากเกินระยะเวลาขยายจากวันครบกำหนดที่ได้ตกลงไว้ บริษัทฯ จะถือว่าทรัพย์สินนั้นตกเป็นกรรมสิทธิ์ของบริษัทฯ",
  "กรณีเอกสารขายฝากสูญหาย ต้องมีเอกสารแจ้งความและสำเนาบัตรประชาชนของเจ้าของทรัพย์สินเพื่อแสดงตัวตนในการทำธุรกรรมทุกครั้ง",
  "สำหรับรายการชำระดอกเบี้ยออนไลน์ จะมีค่าธรรมเนียมการชำระเงิน 5 บาท ต่อรายการ",
];

function TermPage() {
  return (
    <div>
      <DisplayCard>
        <DisplayCard.Header>รายละเอียดและเงื่อนไข</DisplayCard.Header>
        <DisplayCard.Highlight color="base" className="mb-4">
          ข้อตกลงการใช้งาน
        </DisplayCard.Highlight>
        <DisplayCard.OrderList>
          {TERM_LIST.map((content, i) => (
            <li key={i}>{content}</li>
          ))}
        </DisplayCard.OrderList>
      </DisplayCard>
    </div>
  );
}

export default TermPage;
